fras/tm4c1294-hw-demo/Firmware/hw_demo.c
    return 0;
}



// LCD commands.
int LcdCmd(tLcdFwInfo *psLcdFwInfo, char *pcCmd, char *pcParam)
{
    char *pcLcdCmd = pcParam;
    #define LCD_CMD_PARAM_MAX 64
    char *pcLcdParam[LCD_CMD_PARAM_MAX];
    int iLcdParamCnt = 0;
    int iRet = 0;

    // String to store the LCD text parameter.
    char pcLcdText[UI_STR_BUF_SIZE] = "";

    if (pcLcdCmd == NULL) {
        UARTprintf("%s: LCD command required after command `%s'.", UI_STR_ERROR, pcCmd);
        return -1;
    }
    // Parse parameters of the LCD command.
    for (int i = 0; i < LCD_CMD_PARAM_MAX; i++) {
        iLcdParamCnt = i;
        pcLcdParam[i] = strtok(NULL, UI_STR_DELIMITER);
        if (pcLcdParam[i] == NULL) break;
        // Stop splitting the string for the text command, as the last
        // parameter is of the type string a may contain the deliminator
        // string.
        if (!strcasecmp(pcLcdCmd, "text") && (i == 3)) {
            // Pointer to string past terminating 0 of parameter 4;
            char *pcTmp = pcLcdParam[i] + strlen(pcLcdParam[i]) + 1;
            // Cut off deliminators at the beginning.
            pcTmp += strspn(pcTmp, UI_STR_DELIMITER);
            // Copy text parameter without leading deliminator to text parameter string.
            strncpy(pcLcdText, pcTmp, UI_STR_BUF_SIZE - 1);
            if (strtok(NULL, UI_STR_DELIMITER) != 0) {
                iLcdParamCnt = 5;
            } else {
                iLcdParamCnt = 4;
            }
            break;
        }
    }
    // Show help on LCD commands.
    if (!strcasecmp(pcLcdCmd, "help")) {
        LcdHelp();
    // Show info.
    } else if (!strcasecmp(pcLcdCmd, "info")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 0)) < 0) return iRet;
        LcdFwInfo(psLcdFwInfo);
    // Draw circle.
    } else if (!strcasecmp(pcLcdCmd, "circle")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 5)) < 0) return iRet;
        LcdDrawCircle(psLcdFwInfo->psContext,
                      strtoul(pcLcdParam[0], (char **) NULL, 0),
                      strtoul(pcLcdParam[1], (char **) NULL, 0),
                      strtoul(pcLcdParam[2], (char **) NULL, 0),
                      strtoul(pcLcdParam[3], (char **) NULL, 0),
                      strtoul(pcLcdParam[4], (char **) NULL, 0));
    // Fill the display with a color.
    } else if (!strcasecmp(pcLcdCmd, "clear")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 1)) < 0) return iRet;
        LcdClear(psLcdFwInfo->psContext, strtoul(pcLcdParam[0], (char **) NULL, 0));
    // Draw a line.
    } else if (!strcasecmp(pcLcdCmd, "line")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 5)) < 0) return iRet;
        LcdDrawLine(psLcdFwInfo->psContext,
                    strtoul(pcLcdParam[0], (char **) NULL, 0),
                    strtoul(pcLcdParam[1], (char **) NULL, 0),
                    strtoul(pcLcdParam[2], (char **) NULL, 0),
                    strtoul(pcLcdParam[3], (char **) NULL, 0),
                    strtoul(pcLcdParam[4], (char **) NULL, 0));
    // Change the orientation of the display.
    } else if (!strcasecmp(pcLcdCmd, "orient")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 1)) < 0) return iRet;
        LcdSetOrientation(psLcdFwInfo->psContext, strtoul(pcLcdParam[0], (char **) NULL, 0));
    // Draw a pixel.
    } else if (!strcasecmp(pcLcdCmd, "pixel")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 3)) < 0) return iRet;
        LcdDrawPixel(psLcdFwInfo->psContext,
                     strtoul(pcLcdParam[0], (char **) NULL, 0),
                     strtoul(pcLcdParam[1], (char **) NULL, 0),
                     strtoul(pcLcdParam[3], (char **) NULL, 0));
    // Draw a rectangle.
    } else if (!strcasecmp(pcLcdCmd, "rect")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 6)) < 0) return iRet;
        LcdDrawRect(psLcdFwInfo->psContext,
                    strtoul(pcLcdParam[0], (char **) NULL, 0),
                    strtoul(pcLcdParam[1], (char **) NULL, 0),
                    strtoul(pcLcdParam[2], (char **) NULL, 0),
                    strtoul(pcLcdParam[3], (char **) NULL, 0),
                    strtoul(pcLcdParam[4], (char **) NULL, 0),
                    strtoul(pcLcdParam[5], (char **) NULL, 0));
    // Draw a text.
    } else if (!strcasecmp(pcLcdCmd, "text")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 5)) < 0) return iRet;
        LcdDrawText(psLcdFwInfo->psContext,
                    pcLcdText,       // The text message.
                    strtoul(pcLcdParam[0], (char **) NULL, 0),
                    strtoul(pcLcdParam[1], (char **) NULL, 0),
                    strtoul(pcLcdParam[2], (char **) NULL, 0),
                    strtoul(pcLcdParam[3], (char **) NULL, 0));
    } else {
        UARTprintf("%s: Unknown LCD command `%s'!\n", UI_STR_ERROR, pcLcdCmd);
        LcdHelp();
        return -1;
    }
    if (iRet == 0) UARTprintf("%s.", UI_STR_OK);
    return iRet;
}



// Check the number of parameters given for an LCD command.
int LcdCheckParamCnt(char *pcLcdCmd, int iLcdParamCntActual, int iLcdParamCntTarget)
{
    if (iLcdParamCntActual < iLcdParamCntTarget) {
        UARTprintf("%s: The LCD command `%s' requires %d parameter%s, but only %d %s given!",
                   UI_STR_WARNING, pcLcdCmd, iLcdParamCntTarget, (iLcdParamCntTarget == 1) ? "" : "s",
                   iLcdParamCntActual, (iLcdParamCntActual == 1) ? "was" : "were");
        return -1;
    } else if (iLcdParamCntActual > iLcdParamCntTarget) {
        UARTprintf("%s: The LCD command `%s' requires %d parameter%s, but %d %s given! Ignoring the last %d parameter%s.",
                   UI_STR_WARNING, pcLcdCmd, iLcdParamCntTarget, (iLcdParamCntTarget == 1) ? "" : "s",
                   iLcdParamCntActual, (iLcdParamCntActual == 1) ? "was" : "were",
                   iLcdParamCntActual - iLcdParamCntTarget,
                   (iLcdParamCntActual - iLcdParamCntTarget == 1) ? "" : "s");
        return 1;
    }
    return 0;
}



// Show help on LCD commands.
void LcdHelp(void)
{
    UARTprintf("Available LCD commands:\n");
    UARTprintf("  help                                Show this help text.\n");
    UARTprintf("  info                                Show firmware info.\n");
    UARTprintf("  circle  X Y RADIUS COLOR FILL       Draw a circle.\n");
    UARTprintf("  clear   COLOR                       Fill the LCD with COLOR.\n");
    UARTprintf("  line    X1 Y1 X2 Y2 COLOR           Draw a line.\n");
    UARTprintf("  orient  ORIENT                      Set the LCD orientation.\n");
    UARTprintf("  pixel   X Y COLOR                   Draw a pixel.\n");
    UARTprintf("  rect    X1 Y1 X2 Y2 COLOR FILL      Draw a rectangle.\n");
    UARTprintf("  text    X Y COLOR CENTER TEXT       Draw a text message.");
}



// Set the user Leds.
int LedSet(char *pcCmd, char *pcParam)
{
    uint32_t ui32LedSet, ui32LedGet;

    if (pcParam == NULL) {
        UARTprintf("%s: Parameter required after command `%s'.", UI_STR_ERROR, pcCmd);
        return -1;
    }
    ui32LedSet = strtoul(pcParam, (char **) NULL, 0);
    GpioLedSet(ui32LedSet);
    ui32LedGet = GpioLedGet();
    if (ui32LedSet != ui32LedGet) {
        UARTprintf("%s: Setting the Leds to 0x%02x failed!", UI_STR_ERROR, ui32LedSet);
        UARTprintf(" The Leds were set to 0x%02x instead.", ui32LedGet);
        return -1;
    } else {
        UARTprintf("%s: Leds set to 0x%02x.", UI_STR_OK, GpioLedGet());
        return 0;
    }
}



// Set the RGB LED on the Educational BoosterPack MK II.
int RgbLedSet(char *pcCmd, char *pcParam)
{
    uint32_t ui32RgbLedSet;

    if (pcParam == NULL) {
        UARTprintf("%s: Parameter required after command `%s'.", UI_STR_ERROR, pcCmd);
        return -1;
    } else {
        ui32RgbLedSet = strtoul(pcParam, (char **) NULL, 0) & 0xffffff;
        PwmRgbLedSet((ui32RgbLedSet & 0xff0000) >> 16, (ui32RgbLedSet & 0x00ff00) >> 8, (ui32RgbLedSet & 0x0000ff) >> 0);
        UARTprintf("%s: RGB LED set to 0x%06x.", UI_STR_OK, ui32RgbLedSet);
    }

